ruby-on-rails/parking/app/views/sessions/welcome.html.erb


<%@open_tickets = Ticket.where(hour_out: nil).order(:plate)%>
---
SELECT  "tickets".* FROM "tickets" WHERE "tickets"."hour_out" IS NULL ORDER BY "tickets"."plate" ASC LIMIT ?  [["LIMIT", 1]]

<%end%>
<%@closed_tickets = Ticket.where.not(hour_out: nil).order(:hour_out)%>
---
SELECT  "tickets".* FROM "tickets" WHERE ("tickets"."hour_out" IS NOT NULL) ORDER BY "tickets"."hour_out" ASC LIMIT ?  [["LIMIT", 1]]