ruby-on-rails/parking/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "n@d.c"], ["LIMIT", 1]]
---
  def create
    puts session_params
    puts params
    user = User.find_by(email: session_params[:email])