ruby-on-rails/parking/app/controllers/tickets_controller.rb

    def create
        puts "This is a test #{VehicleType.find_by(name: ticketParams[:vtype])[:id]}"
        if Ticket.where(hour_out: nil).count > 9
            flash[:error] = 'No spaces available, try later'
            redirect_to root_path
            return nil
        end
        @current_car = Ticket.where("hour_out is NULL AND plate = ?", ticketParams[:plate]).first

        if @current_car
            flash[:error] = 'The vehicle has an open ticket'
            redirect_to root_path
            return nil
        end

        @ticket = Ticket.new(
            plate: ticketParams[:plate],
            vtype_id: VehicleType.find_by(name: ticketParams[:vtype])[:id],
            hour_in: DateTime.now,
        )
        if @ticket.save
---
SELECT  "vehicle_types".* FROM "vehicle_types" WHERE "vehicle_types"."name" = ? LIMIT ?  [["name", "car"], ["LIMIT", 1]]
SELECT  "tickets".* FROM "tickets" WHERE (hour_out is NULL AND plate = 'aaa000') ORDER BY "tickets"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT COUNT(*) FROM "tickets" WHERE "tickets"."hour_out" IS NULL
SELECT  "tickets".* FROM "tickets" WHERE (hout_out = NULL AND plate = 'asd156') ORDER BY "tickets"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "tickets" ("plate", "vtype", "hour_in", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["plate", "aas000"], ["vtype", "car"], ["hour_in", "2017-09-20 00:00:00"], ["price", 10], ["created_at", "2017-09-21 02:33:34.211684"], ["updated_at", "2017-09-21 02:33:34.211684"]]

    def destroy
        @ticket = Ticket.find(params[:id])
        @ticket.delete
---
SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tickets" WHERE "tickets"."id" = ?  [["id", 1]]

    def bill
        @ticket = Ticket.find(params[:id])
        @ticket.update(
            hour_out: DateTime.now,
        )
        hour_in = @ticket[:hour_in]
        hour_out = @ticket[:hour_out]
        puts "Price is #{VehicleType.find(@ticket[:vtype_id])[:price]}"
---
SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "tickets" SET "hour_out" = ?, "updated_at" = ? WHERE "tickets"."id" = ?  [["hour_out", "2017-09-20 00:00:00"], ["updated_at", "2017-09-21 02:26:59.594814"], ["id", 1]]
SELECT  "vehicle_types".* FROM "vehicle_types" WHERE "vehicle_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]