ruby-on-rails/ajax/app/controllers/ajax_controller.rb

    def last_user
        user_last = User.last
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]

    def random_user
        User.create(name: Faker::Simpsons.character)
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Jebediah Springfield"], ["created_at", "2017-10-05 02:49:53.480816"], ["updated_at", "2017-10-05 02:49:53.480816"]]