ruby-on-rails/parking/app/views/tickets/new.html.erb

<% @available_vehicles = []%>
<% VehicleType.all.each do |x| %>
---
SELECT "vehicle_types".* FROM "vehicle_types"