ruby-on-rails/parking/app/views/tickets/show.html.erb

SELECT  "vehicle_types".* FROM "vehicle_types" WHERE "vehicle_types"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
<ul>
    <li>Type of car: <%= VehicleType.find(@ticket[:vtype_id])[:name].capitalize %></li>